# Задание 1.
# Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
num1 = int(input('Введите первое число: '))
str1 = input('Введите первую строку: ')
num2 = int(input('Введите второе число: '))
print(num1, str1, num2)
